In [1]:
import pandas as pd
import numpy as np

In [2]:
data= pd.read_csv('titanic.csv')
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
data.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'], axis= 'columns', inplace=True)
data.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [5]:
target= data['Survived']
inputs= data.drop(['Survived'], axis='columns')

In [6]:
#Making sex column into numerical
dummy= pd.get_dummies(inputs.Sex)
dummy.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [7]:
#Concat dummy with dataset
inputs= pd.concat([inputs,dummy], axis='columns')
inputs.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [29]:
inputs.drop(['Sex'], axis='columns', inplace=True)
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [30]:
#checking null fields
inputs.isna().sum()

Pclass    0
Age       0
Fare      0
female    0
male      0
dtype: int64

In [31]:
#fill na with mean
#in this case no null value
inputs.Age= inputs.Age.fillna(inputs.Age.mean())
inputs.head(6)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1

In [32]:
from sklearn.model_selection import train_test_split

In [33]:
x_train,x_test,y_train,y_test= train_test_split(inputs,target, train_size=0.8, test_size=0.2)

In [34]:
from sklearn.naive_bayes import GaussianNB

In [35]:
model= GaussianNB()

In [36]:
model.fit(x_train, y_train)

GaussianNB()

In [38]:
#Accuracy
model.score(x_test, y_test)

0.7653631284916201

In [39]:
#Making prediction
model.predict(x_train[:10])

array([1, 0, 0, 1, 0, 1, 0, 0, 0, 0], dtype=int64)

In [42]:
#Probability of surving
model.predict_proba(x_test[:10])
#left mot surviving
#right surviving

array([[9.68044800e-01, 3.19551999e-02],
       [5.20260954e-02, 9.47973905e-01],
       [3.90518555e-07, 9.99999609e-01],
       [9.17987461e-01, 8.20125388e-02],
       [9.91169339e-01, 8.83066124e-03],
       [9.89817642e-01, 1.01823578e-02],
       [9.91219340e-01, 8.78065984e-03],
       [9.89982405e-01, 1.00175948e-02],
       [2.79268813e-02, 9.72073119e-01],
       [8.63707968e-01, 1.36292032e-01]])